# 4.9 - Intro to Data Visualization with Python Part 1

### Table of Contents

* [Step 3](#step3)
* [Step 4](#step4)
    * [Dropping columns](#dropping)
    * [Renaming columns](#rename)
    * [Changing columns data types](#datatype)
    * [Transposing data](#transpose)
* [Step 5](#step5)
    * [Missing Data Checks](#missing1)
    * [Duplicate checks](#duplicate)
* [Step 6](#step6)
* [Step 9](#step9)

# 3. Import your analysis libraries, as well as your new customer data set as a dataframe. <a class="anchor" id="step3"></a>

In [1]:
#Importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#Creating shortcut object for folderpath to Project's folder
path = r'/Users/kerimzengin/Desktop/Data Analytics/Data Analytics Immersion/Achievement 4 - Python Fundamentals for Data Analysts/Instacart Basket Analysis/'

In [3]:
#Importing customers CSV file to the dataframe
customers = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'), index_col = False)

# 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis. <a class="anchor" id="step4"></a>

In [4]:
#showing the basic layout of the dataframe
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Dropping columns <a class="anchor" id="dropping"></a>

### No columns needed to drop

## Renaming columns <a class="anchor" id="rename"></a>

In [5]:
#Renaming the First Name column to first_name
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [6]:
#Renaming Surnam to surname
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [7]:
#Renaming Gender column to gender
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [8]:
#Renaming the STATE column to state
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [9]:
#Renaming the Age column to age
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [10]:
#Renaming the n_dependants to number_of_dependants
customers.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [11]:
#Renaming fam_status column to family_status
customers.rename(columns = {'fam_status' : 'family_status'}, inplace = True)

In [12]:
#Checking if all changes were made correctly
customers.head()

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Changing columns data types <a class="anchor" id="datatype"></a>

### No columns data types needed changing

## Transposing data <a class="anchor" id="transpose"></a>

### No data needed transposing

# 5. Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data. <a class="anchor" id="step5"></a>

## Missing Data Checks <a class="anchor" id="missing1"></a>

In [13]:
#Checking the dataframe for missing/null values
customers.isnull().sum()

user_id                     0
first_name              11259
surname                     0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependants        0
family_status               0
income                      0
dtype: int64

In [14]:
#Create a dataframe for the missing/null values
customers_nan = customers[customers['first_name'].isnull()== True]

In [15]:
#checking the layout of the missing values dataframe
customers_nan

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependants,family_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [16]:
#Showing the number of rows and columns before filtering out missing values
customers.shape

(206209, 10)

In [17]:
#Creating a cleaned dataframe for all non-missing/null values
customers_clean = customers[customers['first_name'].isnull() == False]

In [18]:
#Showing the number of rows and columns after filtering out missing values
customers_clean.shape

(194950, 10)

# Duplicate checks <a class="anchor" id="duplicate"></a>

In [19]:
#Create a dataframe to check and assign any duplicates from the Customers dataframe
customers_dups = customers[customers.duplicated()]

In [20]:
#Show the results for the duplicate checked dataframe
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, number_of_dependants, family_status, income]
Index: []

# 6. Combine your customer data with the rest of your prepared Instacart data. Tip: Make sure the key columns are of the same data type! <a class="anchor" id="step6"></a>

In [21]:
#Importing the dataframe
ords_prods_merge = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_merged_grouped.pkl'))

In [22]:
#Checking the data types for the ords_prods_merge dataframe
ords_prods_merge.dtypes

order_id                      int64
user_id                       int64
eval_set                     object
order_number                  int64
order_days_of_week            int64
order_hour_of_day             int64
days_since_prior_order      float64
product_id                    int64
add_to_cart_order             int64
reordered                     int64
product_name                 object
aisle_id                    float64
department_id               float64
prices                      float64
_merge                     category
price_range_loc              object
busiest_day                  object
busiest_days                 object
slowest_days                 object
busiest_period_of_day        object
max_order                     int64
loyalty_flag                 object
avg_price_orders            float64
spending_habit               object
median_days_prior_order     float64
order_frequency              object
dtype: object

In [23]:
#Checking the data types for the customers dataframe
customers.dtypes

user_id                  int64
first_name              object
surname                 object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
family_status           object
income                   int64
dtype: object

In [24]:
#Dropping the merge flag from previous merge operation to allow the next merging
ords_prods_merge = ords_prods_merge.drop(columns = ['_merge'])

In [25]:
#Merging the cleaned customers dataframe with the previous merged orders/products dataframe
ords_prods_cust_merge = ords_prods_merge.merge(customers_clean, on = ['user_id'], how = 'left', indicator = True)

In [26]:
#Checking if the merge was successful
ords_prods_cust_merge.head()

,order_id,user_id,eval_set,order_number,order_days_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,first_name,surname,gender,state,age,date_joined,number_of_dependants,family_status,income,_merge
0,2398795,1,prior,2,3,7,15.0,196,1,1,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both
1,2398795,1,prior,2,3,7,15.0,10258,2,0,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both
2,2398795,1,prior,2,3,7,15.0,12427,3,1,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both
3,2398795,1,prior,2,3,7,15.0,13176,4,0,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both
4,2398795,1,prior,2,3,7,15.0,26088,5,1,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,both

In [27]:
#Checking if a full merge
ords_prods_cust_merge['_merge'].value_counts()

both          28694579
left_only      1663455
right_only           0
Name: _merge, dtype: int64

# 9. Export this new dataframe as a pickle file so you can continue to use it in the second part of this task. <a class="anchor" id="step9"></a>

In [28]:
#Exporting merged dataframe to the Prepared Folder
ords_prods_cust_merge.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_customers.pkl'))